"""
#　機器學習 HW1-5(2)
# 五個科目的權重為50%、20%、10%、10%、10%"
# 印出每位學生的分數 (五個科目 五個學生)
"""
import numpy as np                  #將numpy縮寫

list2 = [80, 75, 88, 80, 78,
         88, 86, 90, 95, 86,
         92, 85, 92, 98, 90,
         81, 88, 80, 82, 85,
         75, 80, 78, 80, 70]        #設定list

M1 = np.array(list2).reshape(5, 5)  #設定為5X5矩陣
M2 = (M1[:, 0]*0.5+                 #將科目那行x加權
      M1[:, 1]*0.2+ 
      M1[:, 2]*0.1+
      M1[:, 3]*0.1+ 
      M1[:, 4]*0.1)
        
print("以下為學生加權後的成績",'\n'   # print印出答案，str把數字轉成文字，'\n'換行
      "學生1:" , str(M2[0]), '\n',
      "學生2:" , str(M2[1]), '\n',
      "學生3:" , str(M2[2]), '\n',
      "學生4:" , str(M2[3]), '\n',
      "學生5:" , str(M2[4]), '\n' )
